Revit 2027 API
Application.NewInstanceBinding(CategorySet) Method
Creates a new instance binding object containing the categories passed as a parameter.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public InstanceBinding NewInstanceBinding(
	CategorySet categorySet
)
Public Function NewInstanceBinding (
	categorySet As CategorySet
) As InstanceBinding
public:
InstanceBinding^ NewInstanceBinding(
	CategorySet^ categorySet
)
member NewInstanceBinding :
        categorySet : CategorySet -> InstanceBinding
Parameters
categorySet CategorySet
A set of categories that will be added to the binding.
Return Value
InstanceBinding
A new instance binding object.
Remarks
Instance binding objects are used for attaching shared parameter definitions to all instances of an element within a category.
See Also
Reference
Application Class
NewInstanceBinding Overload
Autodesk.Revit.Creation Namespace